Repository: selfcan/StrokeMouse
Catalog: StrokeMouse/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ja, ko, ru, zh_hans, zh_hant

# action.noneHelp
source: No action will run when this gesture matches.
fr: Aucune action ne s’exécutera lorsque ce geste correspond.
ja: このジェスチャが一致しても、アクションは実行されません。
ko: 이 제스처가 일치해도 동작이 실행되지 않습니다.
ru: При совпадении этого жеста действие не выполняется.
zh_hans: 匹配到该手势时不执行任何动作。
zh_hant: 匹配到該手勢時不執行任何動作。

# action.shortcutDisplay
source: Display
fr: Libellé
ja: 表示名
ko: 표시
ru: Подпись
zh_hans: 显示名
zh_hant: 顯示名

# action.shortcutRecord
source: Record
fr: Enregistrer
ja: 記録
ko: 기록
ru: Записать
zh_hans: 录制
zh_hant: 錄製

# action.shortcutStop
source: Stop
fr: Arrêter
ja: 停止
ko: 중지
ru: Остановить
zh_hans: 停止
zh_hant: 停止

# action.shortcutListening
source: Press keys…
fr: Appuyez sur les touches…
ja: キーを押してください…
ko: 키를 누르세요…
ru: Нажмите клавиши…
zh_hans: 请按键…
zh_hant: 請按鍵…

# action.shortcutHelp
source: Click the field or Record, then press the shortcut. Modifier-only shortcuts (e.g. ⌘⇧) are supported.
fr: Cliquez dans le champ ou sur Enregistrer, puis appuyez sur le raccourci. Les raccourcis composés uniquement de touches de modification (p. ex. ⌘⇧) sont pris en charge.
ja: フィールドまたは「記録」をクリックしてからショートカットを押します。修飾キーのみのショートカット（例: ⌘⇧）にも対応しています。
ko: 필드나 기록을 클릭한 뒤 단축키를 누르며, 보조 키만으로 된 단축키(예: ⌘⇧)도 지원됩니다.
ru: Щёлкните поле или «Записать», затем нажмите сочетание. Поддерживаются сочетания только из модификаторов (например, ⌘⇧).
zh_hans: 点击输入框或「录制」后按下快捷键；支持仅修饰键组合（如 ⌘⇧）。
zh_hant: 點選輸入框或「錄製」後按下快捷鍵；支援僅修飾鍵組合（如 ⌘⇧）。

# action.openAppEmpty
source: No app selected. Choose an app to open when this gesture matches.
fr: Aucune app sélectionnée. Choisissez une app à ouvrir lorsque ce geste correspond.
ja: アプリが選択されていません。このジェスチャが一致したときに開くアプリを選んでください。
ko: 선택한 앱이 없으며, 이 제스처가 일치할 때 열 앱을 선택하세요.
ru: Приложение не выбрано: выберите приложение, которое будет открываться при совпадении жеста.
zh_hans: 尚未选择应用，选择一个应用后，匹配到手势时将打开它。
zh_hant: 尚未選擇應用，選擇一個應用後，匹配到手勢時將開啟它。

# action.openAppChoose
source: Choose App…
fr: Choisir une app…
ja: アプリを選択…
ko: 앱 선택…
ru: Выбрать приложение…
zh_hans: 选择应用…
zh_hant: 選擇應用…

# action.openAppChange
source: Change App…
fr: Changer d’app…
ja: アプリを変更…
ko: 앱 변경…
ru: Сменить приложение…
zh_hans: 更换应用…
zh_hant: 更換應用…

# action.openAppHelp
source: When this gesture matches, StrokeMouse will launch the selected app.
fr: Lorsque ce geste correspond, StrokeMouse lancera l’app sélectionnée.
ja: このジェスチャが一致すると、StrokeMouseは選択したアプリを起動します。
ko: 이 제스처가 일치하면 StrokeMouse가 선택한 앱을 실행합니다.
ru: При совпадении этого жеста StrokeMouse запустит выбранное приложение.
zh_hans: 匹配到该手势时，将启动所选应用。
zh_hant: 匹配到該手勢時，將啟動所選應用。

# action.openAppPickerTitle
source: Choose Application
fr: Choisir une application
ja: アプリケーションを選択
ko: 앱 선택
ru: Выбрать приложение
zh_hans: 选择应用
zh_hant: 選擇應用

# action.openAppConfirm
source: Select
fr: Sélectionner
ja: 選択
ko: 선택
ru: Выбрать
zh_hans: 选择
zh_hant: 選擇

# action.shellWarning
source: Shell commands run with your user privileges. Only add trusted commands.
fr: Les commandes Shell s’exécutent avec vos privilèges utilisateur. N’ajoutez que des commandes de confiance.
ja: Shellコマンドは現在のユーザ権限で実行されます。信頼できるコマンドだけを追加してください。
ko: Shell 명령어는 사용자 권한으로 실행되므로 신뢰할 수 있는 명령만 추가하세요.
ru: Команды Shell выполняются с правами вашей учётной записи. Добавляйте только доверенные команды.
zh_hans: Shell 命令以当前用户权限执行，请只添加可信命令。
zh_hant: Shell 命令以當前使用者許可權執行，請只新增可信命令。

# action.shellPlaceholder
source: Enter a shell command…
fr: Saisissez une commande Shell…
ja: Shellコマンドを入力…
ko: Shell 명령어를 입력하세요…
ru: Введите команду Shell…
zh_hans: 输入 Shell 命令…
zh_hant: 輸入 Shell 命令…

# action.appleScriptPlaceholder
source: Enter AppleScript…
fr: Saisissez un AppleScript…
ja: AppleScriptを入力…
ko: AppleScript를 입력하세요…
ru: Введите AppleScript…
zh_hans: 输入 AppleScript…
zh_hant: 輸入 AppleScript…

# action.appleScriptCommand
source: Command
fr: Commande
ja: コマンド
ko: 명령
ru: Команда
zh_hans: 命令
zh_hant: 命令

# action.appleScriptWarning
source: AppleScript runs with your user privileges and may control other apps. Only add trusted scripts.
fr: AppleScript s’exécute avec vos privilèges utilisateur et peut contrôler d’autres apps. N’ajoutez que des scripts de confiance.
ja: AppleScriptは現在のユーザ権限で実行され、ほかのアプリを制御することがあります。信頼できるスクリプトだけを追加してください。
ko: AppleScript는 사용자 권한으로 실행되며 다른 앱을 제어할 수 있으므로 신뢰할 수 있는 스크립트만 추가하세요.
ru: AppleScript выполняется с правами вашей учётной записи и может управлять другими приложениями. Добавляйте только доверенные скрипты.
zh_hans: AppleScript 以当前用户权限执行，并可能控制其他 App，请只添加可信脚本。
zh_hant: AppleScript 以當前使用者許可權執行，並可能控制其他 App，請只新增可信指令碼。

# applescript.sleep
source: Sleep
fr: Veille
ja: スリープ
ko: 잠자기
ru: Режим сна
zh_hans: 睡眠
zh_hant: 睡眠

# applescript.emptyTrash
source: Empty Trash
fr: Vider la Corbeille
ja: ゴミ箱を空にする
ko: 휴지통 비우기
ru: Очистить Корзину
zh_hans: 清空废纸篓
zh_hant: 清空廢紙簍

# applescript.lockScreen
source: Lock Screen
fr: Verrouiller l’écran
ja: 画面をロック
ko: 화면 잠금
ru: Заблокировать экран
zh_hans: 锁定屏幕
zh_hant: 鎖定螢幕

# applescript.startScreenSaver
source: Start Screen Saver
fr: Lancer l’économiseur d’écran
ja: スクリーンセーバを開始
ko: 화면 보호기 시작
ru: Запустить заставку
zh_hans: 启动屏幕保护程序
zh_hant: 啟動螢幕保護程式

# applescript.logOut
source: Log Out
fr: Fermer la session
ja: ログアウト
ko: 로그아웃
ru: Завершить сеанс
zh_hans: 注销
zh_hant: 登出

# applescript.restart
source: Restart
fr: Redémarrer
ja: 再起動
ko: 재시동
ru: Перезагрузить
zh_hans: 重新启动
zh_hant: 重新啟動

# applescript.shutDown
source: Shut Down
fr: Éteindre
ja: システム終了
ko: 시스템 종료
ru: Выключить
zh_hans: 关机
zh_hant: 關機

# applescript.toggleDarkMode
source: Toggle Dark Mode
fr: Activer/désactiver le mode Sombre
ja: ダークモードを切り替える
ko: 다크 모드 전환
ru: Переключить Тёмный режим
zh_hans: 切换深色模式
zh_hant: 切換深色模式

# applescript.hideOthers
source: Hide Others
fr: Masquer les autres
ja: ほかを隠す
ko: 기타 가리기
ru: Скрыть остальные
zh_hans: 隐藏其他应用
zh_hant: 隱藏其他應用

# applescript.muteVolume
source: Mute
fr: Silence
ja: 消音
ko: 음소거
ru: Без звука
zh_hans: 静音
zh_hant: 靜音

# applescript.unmuteVolume
source: Unmute
fr: Réactiver le son
ja: 消音解除
ko: 음소거 해제
ru: Включить звук
zh_hans: 取消静音
zh_hant: 取消靜音

# applescript.openForceQuit
source: Force Quit…
fr: Forcer à quitter…
ja: 強制終了…
ko: 강제 종료…
ru: Завершить принудительно…
zh_hans: 强制退出…
zh_hant: 強制退出…

# applescript.screenshotToClipboard
source: Screenshot to Clipboard
fr: Capture d’écran dans le Presse-papiers
ja: スクリーンショットをクリップボードへ
ko: 스크린샷을 클립보드에 복사
ru: Снимок экрана в буфер обмена
zh_hans: 截图到剪贴板
zh_hant: 截圖到剪貼簿

# applescript.openDownloads
source: Open Downloads
fr: Ouvrir Téléchargements
ja: ダウンロードを開く
ko: 다운로드 열기
ru: Открыть «Загрузки»
zh_hans: 打开下载文件夹
zh_hant: 開啟下載資料夾

# applescript.custom
source: Custom
fr: Personnalisé
ja: カスタム
ko: 사용자화
ru: Свой скрипт
zh_hans: 自定义
zh_hant: 自定義

# media.playPause
source: Play / Pause
fr: Lecture / Pause
ja: 再生 / 一時停止
ko: 재생 / 일시 정지
ru: Воспроизведение / пауза
zh_hans: 播放 / 暂停
zh_hant: 播放 / 暫停

# media.nextTrack
source: Next Track
fr: Morceau suivant
ja: 次の曲
ko: 다음 트랙
ru: Следующий трек
zh_hans: 下一曲
zh_hant: 下一曲

# media.previousTrack
source: Previous Track
fr: Morceau précédent
ja: 前の曲
ko: 이전 트랙
ru: Предыдущий трек
zh_hans: 上一曲
zh_hant: 上一曲

# media.volumeUp
source: Volume Up
fr: Augmenter le volume
ja: 音量を上げる
ko: 음량 높이기
ru: Увеличить громкость
zh_hans: 音量增大
zh_hant: 音量增大

# media.volumeDown
source: Volume Down
fr: Diminuer le volume
ja: 音量を下げる
ko: 음량 낮추기
ru: Уменьшить громкость
zh_hans: 音量减小
zh_hant: 音量減小

# media.mute
source: Mute
fr: Silence
ja: 消音
ko: 음소거
ru: Без звука
zh_hans: 静音
zh_hant: 靜音

# window.close
source: Close
fr: Fermer
ja: 閉じる
ko: 닫기
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# window.minimize
source: Minimize
fr: Placer dans le Dock
ja: しまう
ko: 최소화
ru: Свернуть
zh_hans: 最小化
zh_hant: 縮到最小

# window.zoom
source: Zoom
fr: Réduire/agrandir
ja: 拡大/縮小
ko: 확대/축소
ru: Изменить масштаб
zh_hans: 缩放
zh_hant: 縮放

# window.fullscreen
source: Fullscreen
fr: Plein écran
ja: フルスクリーン
ko: 전체 화면
ru: Полный экран
zh_hans: 全屏
zh_hant: 全屏

# window.hide
source: Hide App
fr: Masquer l’app
ja: アプリを隠す
ko: 앱 가리기
ru: Скрыть приложение
zh_hans: 隐藏应用
zh_hant: 隱藏應用

# window.center
source: Center Window
fr: Centrer la fenêtre
ja: ウインドウを中央に
ko: 윈도우 가운데로
ru: Окно по центру
zh_hans: 窗口居中
zh_hant: 視窗居中

# window.applicationSwitch.commandTab
source: Switch Apps (⌘Tab)
fr: Changer d’app (⌘Tab)
ja: アプリを切り替え（⌘Tab）
ko: 앱 전환 (⌘Tab)
ru: Переключить приложения (⌘Tab)
zh_hans: 切换 App（⌘Tab）
zh_hant: 切換 App（⌘Tab）

# window.applicationSwitch.shiftCommandTab
source: Switch Apps (⇧⌘Tab)
fr: Changer d’app (⇧⌘Tab)
ja: アプリを切り替え（⇧⌘Tab）
ko: 앱 전환 (⇧⌘Tab)
ru: Переключить приложения (⇧⌘Tab)
zh_hans: 切换 App（⇧⌘Tab）
zh_hant: 切換 App（⇧⌘Tab）

# scope.global
source: Global
fr: Toutes les apps
ja: グローバル
ko: 전체
ru: Глобально
zh_hans: 全局
zh_hant: 全域性

# scope.apps
source: Selected Apps
fr: Apps sélectionnées
ja: 選択したアプリ
ko: 선택한 앱
ru: Выбранные приложения
zh_hans: 指定应用
zh_hant: 指定應用

# settings.windowTitle
source: StrokeMouse Settings
fr: Réglages de StrokeMouse
ja: StrokeMouse設定
ko: StrokeMouse 설정
ru: Настройки StrokeMouse
zh_hans: StrokeMouse 设置
zh_hant: StrokeMouse 設定

# editor.startPointHint
source: Red = start point
fr: Rouge = point de départ
ja: 赤 = 始点
ko: 빨강 = 시작점
ru: Красный = начальная точка
zh_hans: 红色 = 起点
zh_hant: 紅色 = 起點

# engine.suppressed
source: Paused while editing
fr: En pause pendant la modification
ja: 編集中は一時停止
ko: 편집 중 일시 정지됨
ru: Приостановлено на время правки
zh_hans: 编辑手势时已暂停
zh_hant: 編輯手勢時已暫停

# general.strokeStyle
source: Gesture Drawing
fr: Dessin des gestes
ja: ジェスチャ描画
ko: 제스처 그리기
ru: Рисование жеста
zh_hans: 手势绘制
zh_hant: 手勢繪製

# general.lineColor
source: Line Color
fr: Couleur du trait
ja: 線の色
ko: 선 색상
ru: Цвет линии
zh_hans: 线条颜色
zh_hant: 線條顏色

# general.lineWidth
source: Line Width
fr: Épaisseur du trait
ja: 線の太さ
ko: 선 두께
ru: Толщина линии
zh_hans: 线条粗细
zh_hant: 線條粗細

# general.showStartPoint
source: Show Start Point
fr: Afficher le point de départ
ja: 始点を表示
ko: 시작점 보기
ru: Показывать начальную точку
zh_hans: 显示起点
zh_hant: 顯示起點

# general.startPointSize
source: Start Point Size
fr: Taille du point de départ
ja: 始点のサイズ
ko: 시작점 크기
ru: Размер начальной точки
zh_hans: 起点大小
zh_hant: 起點大小

# general.strokePreview
source: Preview
fr: Aperçu
ja: プレビュー
ko: 미리보기
ru: Просмотр
zh_hans: 预览
zh_hant: 預覽

# general.startPointFixedRed
source: The start point is always shown as a red circle.
fr: Le point de départ s’affiche toujours sous forme de cercle rouge.
ja: 始点は常に赤い円で表示されます。
ko: 시작점은 항상 빨간 원으로 표시됩니다.
ru: Начальная точка всегда отображается красным кружком.
zh_hans: 起点固定以红色圆圈显示。
zh_hant: 起點固定以紅色圓圈顯示。

# general.resetStrokeStyle
source: Reset Drawing Style
fr: Réinitialiser le style de dessin
ja: 描画スタイルをリセット
ko: 그리기 스타일 재설정
ru: Сбросить стиль рисования
zh_hans: 重置绘制样式
zh_hant: 重置繪製樣式

# editor.recordUseLeftButtonTitle
source: Use the Left Mouse Button
fr: Utilisez le bouton gauche de la souris
ja: マウスの左ボタンを使ってください
ko: 마우스 왼쪽 버튼을 사용하세요
ru: Используйте левую кнопку мыши
zh_hans: 请使用鼠标左键绘制
zh_hant: 請使用滑鼠左鍵繪製

# editor.recordUseLeftButtonBody
source: Press and hold the left mouse button, then drag to record the gesture path on this canvas.
fr: Maintenez le bouton gauche de la souris, puis faites glisser pour enregistrer le tracé du geste sur cette zone.
ja: マウスの左ボタンを押したままドラッグして、このキャンバスにジェスチャの軌跡を記録します。
ko: 마우스 왼쪽 버튼을 누른 채 드래그하여 이 캔버스에 제스처 경로를 기록하세요.
ru: Удерживайте левую кнопку мыши и перетаскивайте, чтобы записать траекторию жеста на этом холсте.
zh_hans: 按住鼠标左键并拖动，在此画布上录制手势轨迹。
zh_hant: 按住滑鼠左鍵並拖動，在此畫布上錄製手勢軌跡。

# editor.recordUseLeftButtonBadge
source: Left-click + drag
fr: Clic gauche + glisser
ja: 左クリック + ドラッグ
ko: 왼쪽 클릭 + 드래그
ru: Левая кнопка + перетаскивание
zh_hans: 左键 + 拖动
zh_hant: 左鍵 + 拖動

# gestures.searchPlaceholder
source: Search name, action…
fr: Rechercher un nom, une action…
ja: 名前、アクションを検索…
ko: 이름, 동작 검색…
ru: Поиск по имени, действию…
zh_hans: 搜索名称、动作…
zh_hant: 搜尋名稱、動作…

# gestures.filter.enabledState
source: Status
fr: État
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态
zh_hant: 狀態

# gestures.filter.all
source: All
fr: Tous
ja: すべて
ko: 모두
ru: Все
zh_hans: 全部
zh_hant: 全部

# gestures.filter.enabled
source: Enabled
fr: Activés
ja: 有効
ko: 활성화됨
ru: Включённые
zh_hans: 已启用
zh_hant: 已啟用

# gestures.filter.disabled
source: Disabled
fr: Désactivés
ja: 無効
ko: 비활성화됨
ru: Выключенные
zh_hans: 已禁用
zh_hant: 已禁用

# gestures.filterEmptyTitle
source: No Matching Gestures
fr: Aucun geste correspondant
ja: 一致するジェスチャがありません
ko: 일치하는 제스처 없음
ru: Нет подходящих жестов
zh_hans: 没有匹配的手势
zh_hant: 沒有匹配的手勢

# gestures.filterEmptySubtitle
source: Try another search keyword or filter.
fr: Essayez un autre mot-clé ou un autre filtre.
ja: 別のキーワードやフィルタを試してください。
ko: 다른 검색어나 필터를 사용해 보세요.
ru: Попробуйте другой запрос или фильтр.
zh_hans: 试试其他关键词或筛选条件。
zh_hant: 試試其他關鍵詞或篩選條件。

# gestures.selectionCount
source: %d selected / %d shown
fr: %d sélectionné(s) / %d affiché(s)
ja: %d件選択 / %d件表示
ko: %d개 선택 / %d개 표시
ru: Выбрано %d / показано %d
zh_hans: 已选 %d / 显示 %d
zh_hant: 已選 %d / 顯示 %d

# gestures.col.enabled
source: On
fr: Activé
ja: オン
ko: 켬
ru: Вкл.
zh_hans: 启用
zh_hant: 啟用

# gestures.col.pattern
source: Path
fr: Tracé
ja: 軌跡
ko: 경로
ru: Траектория
zh_hans: 轨迹
zh_hant: 軌跡

# gestures.col.name
source: Name
fr: Nom
ja: 名前
ko: 이름
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# gestures.col.trigger
source: Trigger
fr: Déclencheur
ja: トリガー
ko: 트리거
ru: Триггер
zh_hans: 触发键
zh_hant: 觸發鍵

# gestures.col.action
source: Action
fr: Action à exécuter
ja: アクション
ko: 동작
ru: Действие
zh_hans: 动作
zh_hant: 動作

# gestures.col.scope
source: Scope
fr: Portée
ja: 範囲
ko: 범위
ru: Область
zh_hans: 范围
zh_hant: 範圍

# gestures.selectAll
source: Select All
fr: Tout sélectionner
ja: すべてを選択
ko: 모두 선택
ru: Выбрать все
zh_hans: 全选
zh_hant: 全選

# gestures.deselectAll
source: Deselect All
fr: Tout désélectionner
ja: すべての選択を解除
ko: 선택 해제
ru: Снять выделение
zh_hans: 取消全选
zh_hant: 取消全選

# gestures.enableSelected
source: Enable
fr: Activer
ja: 有効にする
ko: 활성화
ru: Включить
zh_hans: 启用选中
zh_hant: 啟用選中

# gestures.disableSelected
source: Disable
fr: Désactiver
ja: 無効にする
ko: 비활성화
ru: Выключить
zh_hans: 禁用选中
zh_hant: 禁用選中

# general.triggerButtonHint
source: Deprecated: trigger buttons are configured per gesture.
fr: Obsolète : les boutons de déclenchement se règlent pour chaque geste.
ja: 非推奨: トリガーボタンはジェスチャごとに設定します。
ko: 사용되지 않음: 트리거 버튼은 제스처마다 구성합니다.
ru: Устарело: кнопки триггера задаются отдельно для каждого жеста.
zh_hans: 已弃用：触发键在每条手势中单独配置。
zh_hant: 已棄用：觸發鍵在每條手勢中單獨配置。

# general.engineFooter
source: Trigger mouse button is set on each gesture (default: right button). Short-click still opens the system menu; drag past the minimum distance to draw a gesture.
fr: Le bouton de déclenchement se règle pour chaque geste (par défaut : bouton droit). Un clic court ouvre encore le menu système ; faites glisser au-delà de la distance minimale pour dessiner un geste.
ja: トリガーとなるマウスボタンはジェスチャごとに設定します（デフォルトは右ボタン）。短いクリックではシステムのメニューが開きます。最小距離を超えてドラッグするとジェスチャとして描画します。
ko: 트리거 마우스 버튼은 각 제스처에서 설정하며(기본값: 오른쪽 버튼), 짧게 클릭하면 시스템 메뉴가 열리고 최소 거리를 넘겨 드래그해야 제스처로 그립니다.
ru: Кнопка мыши-триггер задаётся для каждого жеста (по умолчанию — правая). Короткий щелчок по-прежнему открывает системное меню; перетащите дальше минимальной дистанции, чтобы нарисовать жест.
zh_hans: 触发键在每条手势中单独设置（默认右键）；短按仍弹出系统菜单；拖过最小滑动距离才视为手势。
zh_hant: 觸發鍵在每條手勢中單獨設定（預設右鍵）；短按仍彈出系統選單；拖過最小滑動距離才視為手勢。

# editor.triggerGlobalHint
source: Deprecated: use per-gesture trigger button.
fr: Obsolète : utilisez le bouton de déclenchement de chaque geste.
ja: 非推奨: ジェスチャごとのトリガーボタンを使ってください。
ko: 사용되지 않음: 제스처별 트리거 버튼을 사용하세요.
ru: Устарело: используйте кнопку триггера у каждого жеста.
zh_hans: 已弃用：请使用每条手势的触发键设置。
zh_hant: 已棄用：請使用每條手勢的觸發鍵設定。

# editor.triggerPerGestureHint
source: Hold this button, draw the path, then release to run the action. Different gestures can use different buttons.
fr: Maintenez ce bouton, dessinez le tracé, puis relâchez pour exécuter l’action ; différents gestes peuvent utiliser différents boutons.
ja: このボタンを押したまま軌跡を描き、離すとアクションが実行されます。ジェスチャごとに異なるボタンを使えます。
ko: 이 버튼을 누른 채 경로를 그린 다음 놓으면 동작이 실행되며, 제스처마다 다른 버튼을 사용할 수 있습니다.
ru: Удерживайте эту кнопку, нарисуйте траекторию и отпустите, чтобы выполнить действие; у разных жестов могут быть разные кнопки.
zh_hans: 按住此按键绘制轨迹，松开后执行动作；不同手势可使用不同触发键。
zh_hant: 按住此按鍵繪製軌跡，鬆開後執行動作；不同手勢可使用不同觸發鍵。

# toast.noMatch
source: No matching gesture
fr: Aucun geste correspondant
ja: 一致するジェスチャがありません
ko: 일치하는 제스처 없음
ru: Нет подходящего жеста
zh_hans: 无相关手势规则
zh_hant: 無相關手勢規則

# toast.tooShort
source: Stroke too short
fr: Tracé trop court
ja: ストロークが短すぎます
ko: 스트로크가 너무 짧음
ru: Траектория слишком короткая
zh_hans: 滑动距离过短
zh_hant: 滑動距離過短

# action.shortcutEmpty
source: Not set — click Record
fr: Non défini — cliquez sur Enregistrer
ja: 未設定 — 「記録」をクリック
ko: 설정되지 않음 — 기록을 클릭하세요
ru: Не задано — нажмите «Записать»
zh_hans: 未设置 — 点击录制
zh_hant: 未設定 — 點選錄製

# action.shortcutRecordingHint
source: Keys show live as you press. Release all keys to finish; press again to correct; press Esc alone to cancel.
fr: Les touches s’affichent au fur et à mesure. Relâchez toutes les touches pour terminer ; appuyez de nouveau pour corriger ; appuyez uniquement sur Esc pour annuler.
ja: 押したキーがリアルタイムで表示されます。すべてのキーを離すと完了します。やり直すときはもう一度押してください。Escだけを押すとキャンセルします。
ko: 누르는 키가 실시간으로 표시되며, 모든 키를 놓으면 완료되고 다시 누르면 수정되며 Esc만 누르면 취소됩니다.
ru: Клавиши отображаются сразу при нажатии; отпустите все клавиши, чтобы завершить, нажмите снова, чтобы исправить, или нажмите только Esc, чтобы отменить.
zh_hans: 按键会实时显示；松开全部按键即完成；按错直接重按即可修正；单独按 Esc 取消。
zh_hant: 按鍵會實時顯示；鬆開全部按鍵即完成；按錯直接重按即可修正；單獨按 Esc 取消。

# action.shortcutRecorderNeedPermission
source: Cannot start keyboard capture. Grant Accessibility permission and try again.
fr: Impossible de démarrer la capture clavier. Accordez l’autorisation d’accessibilité, puis réessayez.
ja: キーボードの取り込みを開始できません。アクセシビリティを許可してからやり直してください。
ko: 키보드 캡처를 시작할 수 없으니, 손쉬운 사용 권한을 허용한 뒤 다시 시도하세요.
ru: Не удалось начать захват клавиатуры. Предоставьте доступ «Универсальный доступ» и повторите попытку.
zh_hans: 无法启动键盘捕获，请授予辅助功能权限后重试。
zh_hant: 無法啟動鍵盤捕獲，請授予輔助使用許可權後重試。

# action.shortcutUnsupportedModifier
source: Only Command, Option, Control, and Shift are supported as modifier keys.
fr: Seuls Command, Option, Control et Shift sont pris en charge comme touches de modification.
ja: 修飾キーとして使えるのは Command、Option、Control、Shift のみです。
ko: 보조 키는 Command, Option, Control, Shift만 지원됩니다.
ru: В качестве модификаторов поддерживаются только Command, Option, Control и Shift.
zh_hans: 仅支持 Command、Option、Control 和 Shift 作为修饰键。
zh_hant: 僅支援 Command、Option、Control 和 Shift 作為修飾鍵。

# common.ok
source: OK
fr: Valider
ja: 了解
ko: 확인
ru: Готово
zh_hans: 好
zh_hant: 好

# update.section
source: Updates
fr: Mises à jour
ja: アップデート
ko: 업데이트
ru: Обновления
zh_hans: 更新
zh_hant: 更新

# update.sectionFooter
source: Checks run hourly when enabled. Updates download and install only after you confirm.
fr: Les vérifications s’effectuent toutes les heures une fois activées. Les mises à jour ne sont téléchargées et installées qu’après votre confirmation.
ja: オンにすると1時間ごとに確認します。アップデートのダウンロードとインストールは、確認したあとにのみ行われます。
ko: 켜면 매시간 확인하며, 업데이트는 확인한 후에만 다운로드 및 설치됩니다.
ru: При включении проверка выполняется каждый час; обновления загружаются и устанавливаются только после вашего подтверждения.
zh_hans: 启用后每小时检查一次；更新只会在你确认后下载和安装。
zh_hant: 啟用後每小時檢查一次；更新只會在你確認後下載和安裝。

# update.automaticallyChecks
source: Check for updates automatically
fr: Rechercher automatiquement les mises à jour
ja: アップデートを自動的に確認
ko: 업데이트 자동 확인
ru: Автоматически проверять обновления
zh_hans: 自动检查更新
zh_hant: 自動檢查更新

# update.checkNow
source: Check for Updates
fr: Rechercher les mises à jour
ja: アップデートを確認
ko: 업데이트 확인
ru: Проверить обновления
zh_hans: 检查更新
zh_hant: 檢查更新

# update.currentVersion
source: Current Version
fr: Version actuelle
ja: 現在のバージョン
ko: 현재 버전
ru: Текущая версия
zh_hans: 当前版本
zh_hant: 當前版本

# update.checking
source: Checking for updates…
fr: Recherche de mises à jour…
ja: アップデートを確認しています…
ko: 업데이트를 확인하는 중…
ru: Проверка обновлений…
zh_hans: 正在检查更新…
zh_hant: 正在檢查更新…

# update.checkFailed
source: Unable to Check for Updates
fr: Impossible de rechercher les mises à jour
ja: アップデートを確認できません
ko: 업데이트를 확인할 수 없음
ru: Не удалось проверить обновления
zh_hans: 无法检查更新
zh_hant: 無法檢查更新

# update.downloadFromGitHub
source: Download from GitHub
fr: Télécharger depuis GitHub
ja: GitHubからダウンロード
ko: GitHub에서 다운로드
ru: Скачать с GitHub
zh_hans: GitHub 下载
zh_hant: GitHub 下載

# update.unavailableInDevelopment
source: Update checks are unavailable in development or non-app runs. Use a signed .app release build.
fr: La recherche de mises à jour n’est pas disponible en mode développement ou hors app. Utilisez une version .app signée.
ja: 開発モードまたは.app以外の実行ではアップデートを確認できません。署名済みのリリース版.appを使用してください。
ko: 개발 모드나 앱이 아닌 실행에서는 업데이트 확인을 사용할 수 없으니, 서명된 .app 출시 빌드를 사용하세요.
ru: Проверка обновлений недоступна в режиме разработки или при запуске не из .app. Используйте подписанную релизную сборку .app.
zh_hans: 开发模式或非 .app 运行环境无法检查更新，请使用已签名的发布版 .app。
zh_hant: 開發模式或非 .app 執行環境無法檢查更新，請使用已簽名的釋出版 .app。

# update.signingKeyMissing
source: Sparkle public key is not configured yet. This will work after open-source release signing is set up.
fr: La clé publique Sparkle n’est pas encore configurée. Cela fonctionnera une fois la signature des versions open source mise en place.
ja: Sparkleの公開鍵がまだ設定されていません。オープンソースのリリース署名が整うと利用できます。
ko: Sparkle 공개 키가 아직 구성되지 않았으며, 오픈 소스 출시 서명이 설정되면 사용할 수 있습니다.
ru: Открытый ключ Sparkle ещё не настроен. Функция заработает после настройки подписи открытого релиза.
zh_hans: 尚未配置 Sparkle 公钥，完成开源发版签名配置后即可使用。
zh_hant: 尚未配置 Sparkle 公鑰，完成開源發版簽名配置後即可使用。

# update.updaterUnavailable
source: The update service could not start. Relaunch StrokeMouse and try again.
fr: Le service de mise à jour n’a pas pu démarrer. Relancez StrokeMouse, puis réessayez.
ja: アップデートサービスを開始できませんでした。StrokeMouseを再起動してからやり直してください。
ko: 업데이트 서비스를 시작하지 못했으니 StrokeMouse를 다시 연 뒤 시도하세요.
ru: Не удалось запустить службу обновлений. Перезапустите StrokeMouse и повторите попытку.
zh_hans: 更新服务无法启动，请重新启动 StrokeMouse 后再试。
zh_hant: 更新服務無法啟動，請重新啟動 StrokeMouse 後再試。

# update.noUpdate
source: No Updates Available
fr: Aucune mise à jour disponible
ja: 利用できるアップデートはありません
ko: 사용 가능한 업데이트 없음
ru: Обновлений нет
zh_hans: 暂无可用更新
zh_hant: 暫無可用更新

# update.noUpdateMessage
source: No compatible updates are available for this Mac right now.
fr: Aucune mise à jour compatible n’est disponible pour ce Mac pour le moment.
ja: 現在、このMac向けの互換アップデートはありません。
ko: 현재 이 Mac에 호환되는 업데이트가 없습니다.
ru: Сейчас нет совместимых обновлений для этого Mac.
zh_hans: 当前没有适用于此 Mac 的兼容更新。
zh_hant: 當前沒有適用於此 Mac 的相容更新。

source: Update Available
fr: Mise à jour disponible
ja: アップデートがあります
ko: 업데이트 사용 가능
ru: Доступно обновление
zh_hans: 发现可用更新
zh_hant: 發現可用更新

# update.versionAvailable
source: StrokeMouse %@ is available. Would you like to download and install it?
fr: StrokeMouse %@ est disponible. Voulez-vous le télécharger et l’installer ?
ja: StrokeMouse %@ が利用できます。ダウンロードしてインストールしますか？
ko: StrokeMouse %@를 사용할 수 있습니다. 다운로드하여 설치할까요?
ru: Доступна StrokeMouse %@. Загрузить и установить?
zh_hans: StrokeMouse %@ 已发布，是否下载并安装？
zh_hant: StrokeMouse %@ 已釋出，是否下載並安裝？

# update.downloadedReady
source: StrokeMouse %@ has been downloaded and is ready to install.
fr: StrokeMouse %@ a été téléchargé et est prêt à être installé.
ja: StrokeMouse %@ のダウンロードが完了し、インストールできます。
ko: StrokeMouse %@ 다운로드가 완료되어 설치할 준비가 되었습니다.
ru: StrokeMouse %@ загружена и готова к установке.
zh_hans: StrokeMouse %@ 已下载完成，可以安装。
zh_hant: StrokeMouse %@ 已下載完成，可以安裝。

# update.downloadAndInstall
source: Download and Install
fr: Télécharger et installer
ja: ダウンロードしてインストール
ko: 다운로드 및 설치
ru: Загрузить и установить
zh_hans: 下载并安装
zh_hant: 下載並安裝

# update.installAndRelaunch
source: Install and Relaunch
fr: Installer et relancer
ja: インストールして再起動
ko: 설치 후 재실행
ru: Установить и перезапустить
zh_hans: 安装并重新启动
zh_hant: 安裝並重新啟動

# update.installLater
source: Later
fr: Plus tard
ja: あとで
ko: 나중에
ru: Позже
zh_hans: 稍后
zh_hant: 稍後
